# ============================================================
#  Палитра цветов
# ============================================================
C_BG = (0.07, 0.07, 0.08, 1)          # Фон приложения
C_TABLE_HDR = (0.12, 0.30, 0.32, 1)   # Шапка таблицы
C_RED_LINE = (0.85, 0.25, 0.25, 1)    # Красный цвет для контуров и линий
C_SELECTED = (0.22, 0.30, 0.42, 1)    # Выделение
C_TEXT = (0.95, 0.95, 0.95, 1)        # Белый текст
C_TEXT_DIM = (0.70, 0.70, 0.70, 1)    # Серый текст

# Цвета для кнопок
C_BTN = (0.12, 0.30, 0.32, 1)         # Темно-бирюзовый фон кнопки
C_BTN_DOWN = (0.07, 0.18, 0.20, 1)    # Светлый бирюзовый при нажатии (эффект клика)0.25, 0.55, 0.60, 1
C_BTN_DISABLED = (0.12, 0.12, 0.12, 1) # Еще более темный для неактивных
C_TEXT_DISABLED = (0.40, 0.40, 0.40, 1) # Тусклый текст для неактивных

# Цвета фона для уровней
C_LVL_RP = (0.11, 0.11, 0.11, 1)      # Ответственный
C_LVL_ORG = (0.14, 0.14, 0.14, 1)     # Организация
C_LVL_STORE = (0.17, 0.17, 0.17, 1)   # Магазин
C_LVL_HEADER = (0.08, 0.08, 0.08, 1)  # Заголовки (Контакты ЛПР / Оплаты)
C_LVL_CONTACT = (0.12, 0.12, 0.12, 1) # Контакты (ФИО)